In [2]:
!python -m pip install pandas

Collecting pandas
  Downloading pandas-3.0.0-cp314-cp314-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=2.3.3 in c:\users\almas\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\almas\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata in c:\users\almas\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\almas\appdata\local\programs\python\python314\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-3.0.0-cp314-cp314-win_amd64.whl (9.9 MB)
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   -- ------------------------------------- 0.5/9.9 MB 3.0 MB/s eta 0:00:04
   ------------ --------------------------- 3.1/9.9 MB 9.0 MB/s eta 0:00:01
   ----------------------------- ---------- 7.3/9.9 MB 13.7 MB/s eta 0:00:01
   ---------------------------------------- 9.9/9.9 MB 13.8 MB/s  0:00:01
Installing collected packages: pandas
Successfully installed pandas-3.0.0

In [3]:
import pandas as pd

In [4]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [19, 21, 22, 20, 23],
    "Score": [85, 78, 92, 88, 95]
}

df = pd.DataFrame(data)
df

      Name  Age  Score
0    Alice   19     85
1      Bob   21     78
2  Charlie   22     92
3    David   20     88
4      Eva   23     95

In [5]:
df.head(3)

      Name  Age  Score
0    Alice   19     85
1      Bob   21     78
2  Charlie   22     92

In [6]:
df.describe()

             Age      Score
count   5.000000   5.000000
mean   21.000000  87.600000
std     1.581139   6.580274
min    19.000000  78.000000
25%    20.000000  85.000000
50%    21.000000  88.000000
75%    22.000000  92.000000
max    23.000000  95.000000

In [7]:
df["Score"].mean()

np.float64(87.6)

In [8]:
df[df["Age"] > 20]

      Name  Age  Score
1      Bob   21     78
2  Charlie   22     92
4      Eva   23     95

In [9]:
df[df["Score"] > 80]

      Name  Age  Score
0    Alice   19     85
2  Charlie   22     92
3    David   20     88
4      Eva   23     95